{"Books\n\n1.\tKC, DB (editor) Methods in Molecular Biology, Computational Prediction of Post-translational Modification Sites, 2022, Springer US.\n\nBook Chapter in Press \n\n1.\tPokharel S*, Sidorov E*, Caragea D, KC DB#, NLP-based encoding techniques for prediction of post-translational modification sites and protein functions, in Machine Learning in Bioinformatics of Protein Sequences, Editor: Kurgan, L, 2023 (In press).\n\nBook Chapters\n\n1.\tAl-Barakati H*, Newman RH, KC DB#, Poole LB#, Bioinformatic Analyses of Peroxiredoxins and RF-Prx: A random forest-based predictor and classifier for Prxs, Methods in Molecular Biology: Computational Methods for predicting post-translational modification sites, Editor, KC DB, 2022, 155-176, 2022.\n2.\tPakhrin SC*, Pokharel S*, Saigo H, KC DB#, Deep Learning–Based Advances In Protein Post-translational Modification Site and Protein Cleavage Prediction, Methods in Molecular Biology: Computational Methods for predicting post-translational modification sites, Editor, KC DB, 285-322, 2022.\n3.\tIsmail H*, White C*, Al-Barakati H*, Newman RH, KC DB#, FEPS: A tool for feature extraction from protein sequence, Methods in Molecular Biology: Computational Methods for predicting post-translational modification sites, Editor, KC DB, 285-322, 2022\n4.\tAl-Barakati H*, Newman RH, KC DB#, Poole LB#, Bioinformatic Analyses of Peroxiredoxins and RF-Prx: A random forest-based predictor and classifier for Prxs, Methods in Molecular Biology: Computational Methods for predicting post-translational modification sites, Editor, KC DB, 2022, 155-176, 2022.\n5.\tPakhrin SC*, Pokharel S*, Saigo H, KC DB#, Deep Learning–Based Advances In Protein Post-translational Modification Site and Protein Cleavage Prediction, Methods in Molecular Biology: Computational Methods for predicting post-translational modification sites, Editor, KC DB, 285-322, 2022.\n6.\tIsmail H*, White C*, Al-Barakati H*, Newman RH, KC DB#, FEPS: A tool for feature extraction from protein sequence, Methods in Molecular Biology: Computational Methods for predicting post-translational modification sites, Editor, KC DB, 285-322, 2022.\n7.\tMacCarthy E*, Perry D*, KC DB#, Advances in proteins super-secondary structure prediction and application to protein structure prediction, Methods in Molecular Biology: Protein Supersecondary structure, Editor: Kister A, 2019": null, " 1958:15-4.\n8.\tDennis R Livesay, KC DB, David, La, Predicting protein functional sites with phylogenetic motifs: Past, present and beyond. To appear in Omics approaches for protein function prediction, Kihara D (Ed.), Springer, 2010.\n9.\tKC DB, Dennis R Livesay, A spectrum of phylogenetic-based approaches for predicting protein functional sites, In Bioinformatics for Systems Biology, Krawetz S (Ed.), Humana Press. ISBN: 978-1-934115-02-2, 2009.\n\nJournal Papers Submitted\n1.\tPratyush P*, Pokharel S*, Hiroto S, KC DB#, pLMSNOSite:  prediction of protein s-nitrosylation sites using embeddings from language model, BMC Bioinformatics, submitted.\n2.\tPakhrin S*, Pokharel S*, Aoki-kinoshita KF, Caragea D, KC DB#, LMNGlyPred: prediction of human n-lined glycosylation site using embeddings from pre-trained protein language model, Glycobioly, Submitted. \n\nJournal Papers - in Revision \n\n1.\tPokharel S*, Pratyush P*, Heinzinger M, Newman RH, KC DB#, LMSuccSite: Improving Protein succinylation sites prediction using embeddings from protein language model, Scientific Reports, In Revision.\n\n\nJournal Papers – Published \n\n1.\tMaccarthy E*, Zhang C, Zhang Y, KC DB#, GPU-ITASSER: a GPU accelerated I-TASSER protein structure prediction tool, Bioinformatics, 38(6):1754-1755, 2022.\n2.\tSaigo H, KC DB, Saito N, Einstein-Roscoe regression for the slag viscosity problem in steelmaking, Scientific Reports, 12(1), 1-9, 2022. \n3.\tPakhrin SC*, Aoki-Kinoshita KF, Caragea D, KC DB#, DeepNGlyPred: A Deep neural network-based approach for human N-linked glycosylation site prediction, Molecules, 27(23), 7314, 2021. \n4.\tChaudhari M*, Thapa N*, Ismail H*, Chopade S*, Caragea D, Kohn M, Newman RH, KC DB#, DTL-DephosSite: Deep transfer learning-based approach to predict dephosphorylation sites, Front. Cell Dev. Biol., 662983, 2021.\n5.\tPakhrin SC*, Shrestha B, Adhikari B, KC DB#, Deep Learning-based advances in protein structure prediction, Int. J. Mol. Sci, 2032, 22(11), 5553, 2021.\n6.\tThapa N*, Chaudhari M*, Iannetta A, White C, Roy K, Newman RH, Hicks LM, KC DB#, A deep learning based approach for prediction of Chlamydomonas reinhardtii phosphorylation sites, Scientific Reports, 11, 12550, 2021.\n7.\tThapa N*, Liu, Z, KC DB,  Gokaraju B,  Roy K, Comparison of machine learning and deep learning models for network intrusion detection systems, Future Internet, Vol. 12, 10, 167, 2020.\n8.\tChaudhari M*, Thapa N*, Roy K, Newan RH, Saigo H, KC DB#, DeepRMethylSite: A Deep Learning Based Approach for prediction of arginine methylation sites in Proteins, Molecular Omics, 16, 448-454, 2020.\n9.\tThapa N*, Chaudhari M*, McManus S, Roy, K, Newman RH, Saigo H, KC DB#  \nDeepSuccinylSite: a deep learning based approach for protein succinylation site prediction, BMC Bioinformatics, 21(3), 1-10, 2020. \n10.\tAl-barakati H*, Thapa N*, Saigo H, Roy K, Newman RH, KC DB#, RF-MaloSite and DL-MaloSite: Methods based on random forest and deep learning to identify malonylation sites, Computational Structural Biotechnology Journal, 18:852-860, 2020.\n11.\tAlbarakati H*, Saigo H, Newman RH, KC DB#, RF-GlutarySite: Random Forest based predictor for Glutarylation sites, Molecular Omics, doi, 10.1039, 2019. (Selected for cover article)\n12.\tIsmail H*, Saigo H, KC DB#, RF-NR: Random forest based approach for improved classification of nuclear receptors, In IEEE ACM Transactions on Bioinformatics and Computational Biology, Vol 15, No 6., 2018. \n13.\tAlbarakati H*, McConnell EW, Hicks, LM, Poole LB, Newman RH, KC DB#, SVM-SulfoSite: A support vector machine based predictor for sulfenylation sites, Scientific Reports, 8: 11288, 2018.\n14.\tAmini H, Wang LJ, Hasemisohi A, Bikdash M, KC DB, Yuan WQ, An integrated growth kinetics and computational fluid dynamics model for the analysis of algal productivity in open raceway ponds, Computers and Electronics in Agriculture, 145, 363-372, 2018.\n15.\tWhite C*, Ismail H*, Saigo H., KC DB#, CNN-BLPred: A Convolutional Neural Network based predictor for Beta lactamases (BL) and their class, BMC Bioinformatics, 18(Suppl 16):577, 2017.\n16.\tKC DB#, Recent advances in sequence-based protein structure prediction \nBriefings in Bioinformatics,1:18(6):1021-1032, 2017.\n17.\tChapman CH*, Adami C, Wilke CO, KC DB# \nThe evolution of logic circuits for the purpose of protein contact map prediction \nPeerJ, 5:e3139 https://doi.org/10.7717/peerj.3139, 2017.\n18.\tIsmail H*, Newman RH, KC DB#, RF-Hydroxysite: a random forest based predictor for hydroxylation sites \nMolecular Biosystems, 12(8):2427-35, 2016\n19.\tJha A*, Flurchick KM, Bidash M, KC DB# \nParallel-SymD: A parallel approach to detect internal symmetry in protein domains\nBioMed Research International, 2016, 4628592.\n20.\tJiang Y,…, Chapman CH*, KC DB, …., Predrag Radivojac, An expanded evaluation of protein function prediction methods show an improvement in accuracy, Genome Biology, 17:184, 2016.\n21.\tIsmail H*, Jones A*, Kim J., Newman R., KC DB#: Improved Random Forest based prediction of phosphorylation sites, Biomed Research International, 2016, 3281590.\n22.\tAmini H, Shahbazi A, Bikdash M, KC DB, Yuan W, Hashemisohi A, Wang L \nNumerical and experimental investigation of hydrodynamics and light transfer in open raceway ponds at various algal cell concentrations and medium depths \nChemical Engineering Science 156, 11-23, 2016.\n23.\t Khan IK, Wei Q, Chapman S*, KC DB, Kihara D: PFP and ESG protein function prediction methods in 2014: Effects of database updates and ensemble approaches, Giga Science, 4:43, 2015.\n24.\t CH Tai, Rohit P, KC DB, Shilling J, Lee BK, SymD webserver: a platform for detecting internally symmetric protein structures, Nucleic Acids Res, 42(W1):W296-W300, 2014. \n25.\tYu Y, Megri AC, Flurchick KM, KC DB, The improvement of the computational performance of the zonal model POMA using parallel techniques, American Journal of Engineering and Applied Sciences 7(1): 185-193, 2014, Science Publication.\n26.\t KC DB#, Structure-based methods for computational protein functional site prediction,  Comput Struct Biotechnology J, 8: e201308005, 2013.\n27.\tKC DB and Livesay DR, Topology improves phylogenetic motif functional site predictions, IEEE/ACM Transactions on Computational Biology and Bioinformatics, 8:226-233, 2011.\n28.\t KC DB#, Improving Consensus Structure by Eliminating Averaging Artifacts, BMC Structural Biology, 9:12, 2009.\n29.\t KC DB and Livesay DR, Improving position specific predictions of protein functional sites using phylogenetic motifs, Bioinformatics, 24:2308-2316, 2008.\n30.\t Brown JB, KC DB, Tomita E, Akutsu T, Multiple methods for protein side chain packing using maximum weight cliques, Genome Informatics, 17-1, 3-12, 2006.\n31.\t Akutsu T, Hayashida M, KC DB, Tomita E, Suzuki J,  Horimoto K, Protein Threading by Dynamic Programming and Clique Based Approaches, IEICE Transactions on Fundamentals of Electronics, Communication and Computer Science, E89-A, 1215-1222, 2006.\n32.\t KC DB, Jun’ichi Suzuki J, Horimoto K, Akutsu T, Protein Threading With Profiles and Distance Constraints Using Clique Based Algorithms, Journal of Bioinformatics and Computational Biology, 4:19-42, 2006.\n33.\t Moesa HA, KC DB, Akutsu T, Efficient Determination of Cluster Boundaries for Analysis of Gene Expression Profile Data Using Hierarchical Clustering and Wavelet Transform, Genome Informatics, 16(1): 132-141, 2005.\n34.\t KC DB, Tomita E, Suzuki J, Akutsu T, Protein side-chain packing problem: A maximum common edge-weight clique algorithmic approach, Journal of Bioinformatics and Computational Biology, 3(1): 103-126, 2005.\n35.\tKC DB, Akutsu T, Tomita E, Seki T, Fujiyama A, Point Matching Under Non-uniform Distortions and Protein Side Chain Packing Based on an Efficient Clique Algorithm, Genome Informatics, 13: 143-152, 2002.": null}
